Revit 2027 API
AdvancedWood.WoodSecondaryPerlinProf Property
 The property labeled "Profile for secondary highlight perlin noise" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodSecondaryPerlinProf { get; }
Public Shared ReadOnly Property WoodSecondaryPerlinProf As String
	Get
public:
static property String^ WoodSecondaryPerlinProf {
	String^ get ();
}
static member WoodSecondaryPerlinProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace